a=float(input("Введіть значення сторони а:")) #Задаємо значення  a
b=float(input("Введіть значення сторони b:")) #Задаємо значення  b
c=float(input("Введіть значення сторони c:")) #Задаємо значення  c
if (a+b)<=c or (a+c)<=b or (b+c)<=a or a==b==c==0:
    print ("Помилка")
    if a**2+b**2==c**2: #Умова для прямокутного трикутника
        print("Навпроти сторони с лежить прямий кут\nНавпроти сторони b лежить гострий кут\nНавпроти сторони a лежить гострий кут")
    elif a**2+c**2==b**2:
        print ("Навпроти сторони b лежить прямий кут\nНавпроти сторони a лежить гострий кут\nНавпроти сторони c лежить гострий кут")
    elif c**2+b**2==a**2:
        print("Навпроти сторони a лежить прямий кут\nНавпроти сторони b лежить гострий кут\nНавпроти сторони c лежить гострий кут")
    elif (a**2+b**2)<c**2: #Умова для тупокутнго трикутника
        print("Навпроти сторони c лежить тупий кут\nНавпроти сторони b лежить гострий кут\nНавпроти сторони a лежить гострий кут ")
    elif (c**2+b**2)<a**2:
        print("Навпроти сторони a лежить тупий кут\nНавпроти сторони b лежить гострий кут\nНавпроти сторони c лежить гострий кут ")
    elif (a**2+c**2)<b**2:
        print("Навпроти сторони b лежить тупий кут\nНавпроти сторони a лежить гострий кут\nНавпроти сторони c лежить гострий кут")
else:
    print ("Всі кути трикутника гострі")
input ("press ENTER to exit")
